-- Лабораторна робота №1
-- студент групи АнД-31 

-- Завдання 1. Наведiть приклади виразiв вказаного типу. Кожен список має мiстити кiлька елементiв [([(Bool,String)],[Double])]
-- [([(True,"asd gas wer"),(False,"dsf ewfds ds")],[1.3,1.3,0.5])]
-- [([(False,"aefcx ewfmk"),(False,"dsfewf sdfwr sa")],[1.7,5.342,3.12])]

-- Завдання 2. Функцiя визначає, чи двi точки, заданi координатами, знаходяться уодному квадрантi.
funk1 :: Int -> Int -> Int -> Int -> Bool 
funk1 x1 y1 x2 y2
  | x1 >= 0 && x2 >= 0 && y1 >= 0 && y2 >= 0 = True
  | x1 >= 0 && x2 >= 0 && y1 <= 0 && y2 <= 0 = True
  | x1 <= 0 && x2 <= 0 && y1 >= 0 && y2 >= 0 = True
  | x1 <= 0 && x2 <= 0 && y1 <= 0 && y2 <= 0 = True
  | otherwise = False

-- Висновок. У ході виконання лабораторної роботи №1 було наведені приклади кортежів з різними типами даних, а також зроблено ф-ю,
-- яка перевіряє чи знаходяться дві точки на графіку в одному квадраті.