-- Лабораторна робота №4
-- студент групи АнД-31
-- Українець Андрій Олександрович
-- Варіант №12

-- Мета роботи: Ознайомитись з системою типiв та класiв типiв. Набути досвiду визначення нових типiв та класiв типiв i їх використання.

-- Завдання 1. Записник. У записнику зберiгається iнформацiя про знайомих: телефон (iм’я, телефон — один, або кiлька),
-- нагадування про день народження (iм’я, дата — день та мiсяць), зустрiчi (дата та час, мiсце, опис — тема зустрiчi,
-- зауваження про зустрiч — чи вiдбулась та iнше). Визначне функцiї для: пошуку iмен за першою лiтерою iменi;

data Info = Info String String String
nameOfInfo (Info name _ _ )=name
numberOfInfo (Info _ number _ )=number
dataOfInfo (Info _ _ hb)=hb

about = [Info "Andrey" "+380503842944" "03.02.2002",
         Info "Maks" "+380502849583" "26.10.1997",
         Info "Vlad" "+380502816490" "17.03.2005",
         Info "Sonya" "+380504839033" "16.06.1994",
         Info "Andrey" "+380501820432" "01.08.2010"]

checkLetter letter xs  = if letter == head xs then True else False
checkName _ []=[]
checkName letter (x : xs) = if checkLetter letter (nameOfInfo x) then (nameOfInfo x, numberOfInfo x, dataOfInfo x):checkName letter xs else checkName letter xs

findName letter = [checkName letter about]

-- Результат роботи:
-- Для тестування потрібно ввести так команди:
-- ghci
-- :l Lab4\\Lab4.hs
-- findName 'A'
-- [[("Andrey","+380503842944","03.02.2002"),("Andrey","+380501820432","01.08.2010")]]

--findName 'S'
--[[("Sonya","+380504839033","16.06.1994")]]


-- Висновок. У ході виконання лабораторної роботи №4 ми навчилися працювати з класами. Було сворено записник в якому записано: ім'я,
-- номер мобільного телефону та дата народження. Також створили фукцію, яка шукає людину за першою літерою імені, якщо людей декілька,
-- то виведе ту кількість, яка занесена у записник.