-- Лабораторна робота №2
-- студент групи АнД-31
-- Українець Андрій Олександрович
-- Варіант №12

-- Мета роботи: Набути досвiду визначення рекурсивних функцiй, використання механiзму зiставлення
--  зi зразком i роботи з кортежами та списками.

-- Завдання 1. Вставити у список через кожнi n елементiв вказане значення, напр. через n=2 значення ’z’: "1234590"⇒ "12z34z59z0".
insert :: Int -> a -> [a] -> [a]
insert 0 y xs = xs
insert n y [] = []
insert n y xs 
  | length xs < n = xs
  | otherwise = take n xs ++ [y] ++ insert n y (drop n xs)

-- Результат роботи:
-- Для тестування потрібно ввести так команди:
-- ghci
-- :load Lab2\\Lab2.hs
-- insert 3 'z' "12312312"
--"123z123z12"

-- Завдання 2. Знайти перше просте число в указаному дiапазонi.
isPrime :: Integral a => a -> Bool
isPrime k = (k > 1) && null [ x | x <- [2..k - 1], k `mod` x == 0]
 
func :: [Int]->Int 
func xs = if isPrime (head xs) then head xs else func (drop 1 xs)
-- Результат роботи:
-- Для тестування потрібно ввести так команди:
-- func [1,4,6,8,7,4,2,3]
-- 7

-- Висновок. У ході виконання лабораторної роботи №2 було розроблено ф-ю, яка вставляє елемент через кожні n елементів у список,
-- а також ф-ю, яка виводить перше знайдене просте число у вказаному діапазоні. Головне це ми навчилися робити ф-ї за допомогою рекурсії.