{-# LANGUAGE DataKinds #-}
-- Лабораторна робота №3
-- студент групи АнД-31
-- Українець Андрій Олександрович
-- Варіант №12

-- Мета роботи: Набути досвiду визначення та використання функцiй вищого порядку.

-- Завдання 1. Роздiлити список на двi частини при заданiй довжинi першої n, напр. при n=3: "abcdefghik"⇒ ("abc "defghik").
split :: Int -> [Char] -> ([Char],[Char])
split _[] = ([],[])
split y (x:xs)
            |length z1 < y = (x:z1,z2)
            |length z1 == y = (z1,x:z2)
                where (z1,z2) = split y xs

-- Результат роботи:
-- Для тестування потрібно ввести так команди:
-- ghci
-- :load Lab2\\Lab2.hs

-- Завдання 2. Перевiрити гiпотезу Ґольдбаха у вказаному дiапазонi.
dm :: Int -> [ Int ] -> [ Int ]
dm x xs = [ y | y <- xs , y `mod ` x /= 0]

da :: [ Int ] -> [ Int ]
da ( x : xs ) = x : da ( dm x xs )

primes :: [ Int ]
primes = da [2 ..]

goldbach :: Int -> [(Int, Int)]
goldbach n = [(a, b) | a <- takeWhile (<n) primes, b <- takeWhile (<n) primes, n == a + b]
-- Результат роботи:
-- Для тестування потрібно ввести такі команди:
-- goldbach 8
-- [(3,5),(5,3)]

-- Висновок. У ході виконання лабораторної роботи №2 було розроблено ф-ю, яка вставляє елемент через кожні n елементів у список,
-- а також ф-ю, яка виводить перше знайдене просте число у вказаному діапазоні. Головне це ми навчилися робити ф-ї за допомогою рекурсії.